testCase/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application pimpleFoam;

//startFrom latestTime;
startFrom startTime;

startTime 0;

stopAt nextWrite;
//stopAt noWriteNow;
//stopAt endTime;

endTime 0.02;

deltaT 0.00001;

writeControl adjustableRunTime;

writeInterval 0.0001;

purgeWrite 0;

writeFormat ascii;

writePrecision 6;

writeCompression uncompressed;

timeFormat general;

timePrecision 6;

runTimeModifiable true;

adjustTimeStep yes;

maxCo 1;

functions
{


fieldAverage1
    {
        type            fieldAverage;
        functionObjectLibs ("libfieldFunctionObjects.so");
        enabled         true;
        outputControl   outputTime;
        timeStart 0.04;

        fields
        (
            U
            {
                mean        on;
                prime2Mean  on;
                base        time;
            }
	
        );
    }
}

libs
(
    //"libOpenFOAM.so"
    "libturbulentMappedField.so"
);

// ************************************************************************* //
