testCase/0/UU
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    location    "0";
    object      UU;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform (0 0 0 0 0 0);

boundaryField
{
	 inlet
    {
        type            	zeroGradient;
    }

    outlet
    {
        type            	zeroGradient;
    }
    sides
    {
		type				zeroGradient;
    }
 	jet
    {
        type            	zeroGradient;
    }
    bluff
    {
        type            	zeroGradient;
    }

}
// ************************************************************************* //
